2020.07.27   
실습자료 5,6 참고

In [1]:
import pandas as pd

In [5]:
student_list = [
    {'name':'kang', 'sex':'female','major':'Computer Science'},
    {'name':'hana', 'sex':'male','major':'python'},
    {'name':'hong', 'sex':'male','major':'java'},
    {'name':'esther', 'sex':'female','major':'Computer Science'},
    {'name':'kim', 'sex':'female','major':'java'},
    {'name':'nara', 'sex':'male','major':'python'},
    {'name':'lee', 'sex':'female','major':'Computer Science'},
    {'name':'haha', 'sex':'female','major':'java'},
    {'name':'hohee', 'sex':'male','major':'python'},
    {'name':'leejo', 'sex':'female','major':'Computer Science'},
]
df = pd.DataFrame(student_list)
df

     name     sex             major
0    kang  female  Computer Science
1    hana    male            python
2    hong    male              java
3  esther  female  Computer Science
4     kim  female              java
5    nara    male            python
6     lee  female  Computer Science
7    haha  female              java
8   hohee    male            python
9   leejo  female  Computer Science

In [16]:
type(student_list)

list

In [6]:
major_group = df.groupby('major')
major_group.groups

{'Computer Science': Int64Index([0, 3, 6, 9], dtype='int64'),
 'java': Int64Index([2, 4, 7], dtype='int64'),
 'python': Int64Index([1, 5, 8], dtype='int64')}

In [8]:
type(major_group) # dictionary 형태임

pandas.core.groupby.generic.DataFrameGroupBy

In [69]:
'''
groups : dict
    {group name -> group labels}
len(grouped) : int
    Number of groups
'''
major_group.groups['Computer Science']

Int64Index([0, 3, 6, 9], dtype='int64')

In [71]:
for name, group in major_group.groups.items():
    print(name,":",group)

Computer Science : Int64Index([0, 3, 6, 9], dtype='int64')
java : Int64Index([2, 4, 7], dtype='int64')
python : Int64Index([1, 5, 8], dtype='int64')

In [72]:
for name, group in major_group:
    print(name,":",group)

Computer Science :      name     sex             major
0    kang  female  Computer Science
3  esther  female  Computer Science
6     lee  female  Computer Science
9   leejo  female  Computer Science
java :    name     sex major
2  hong    male  java
4   kim  female  java
7  haha  female  java
python :     name   sex   major
1   hana  male  python
5   nara  male  python
8  hohee  male  python

In [13]:
for name, group in major_group:
    print(name,":",len(group))

Computer Science : 4
java : 3
python : 3

### df.duplicated()

In [31]:
student_list2 = [
    {'name':'kang', 'sex':'female','major':'Computer Science'},
    {'name':'hana', 'sex':'male','major':'python'},
    {'name':'hong', 'sex':'male','major':'java'},
    {'name':'esther', 'sex':'female','major':'Computer Science'},
    {'name':'kim', 'sex':'female','major':'java'},
    {'name':'nara', 'sex':'male','major':'python'},
    {'name':'lee', 'sex':'female','major':'Computer Science'},
    {'name':'haha', 'sex':'female','major':'java'},
    {'name':'hohee', 'sex':'male','major':'python'},
    {'name':'leejo', 'sex':'female','major':'Computer Science'},
    {'name':'kang', 'sex':'male','major':'Computer Science'},
]

In [32]:
df2 = pd.DataFrame(student_list2)

In [34]:
df2.duplicated() # 모든 속성이 동일해야 return True

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
dtype: bool

기준을 정할 수도 있음.

In [35]:
df2.duplicated(['name'])

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10     True
dtype: bool

- 삭제

### keep{‘first’, ‘last’, False}, default ‘first’
- Determines which duplicates (if any) to keep. 
- first : Drop duplicates except for the first occurrence.
- last : Drop duplicates except for the last occurrence. 
- False : Drop all duplicates.

In [45]:
df2 = df2.drop_duplicates(['name'],keep='last')

In [47]:
df2 # 중복된 row들 중 마지막이 남아있는 것을 볼 수 있음

      name     sex             major
1     hana    male            python
2     hong    male              java
3   esther  female  Computer Science
4      kim  female              java
5     nara    male            python
6      lee  female  Computer Science
7     haha  female              java
8    hohee    male            python
9    leejo  female  Computer Science
10    kang    male  Computer Science

In [51]:
date_list = [
    {'yyyy-mm-dd':'2003-04-18'},
    {'yyyy-mm-dd':'2010-05-12'},
    {'yyyy-mm-dd':'2020-07-27'},
]
df3 = pd.DataFrame(date_list, columns= ['yyyy-mm-dd'])
df3

   yyyy-mm-dd
0  2003-04-18
1  2010-05-12
2  2020-07-27

In [67]:
# method 1
df3['year'] = pd.to_datetime(df3['yyyy-mm-dd'], format='%Y-%m-%d %H:%M:%S', errors='raise').dt.year

In [58]:
df3

   yyyy-mm-dd  year
0  2003-04-18  2003
1  2010-05-12  2010
2  2020-07-27  2020

In [59]:
# method 2
def get_year(column):
    return column.split('-')[0]
get_year('2002-09-09')

'2002'

In [61]:
df3['year'] = df3['yyyy-mm-dd'].apply(get_year)
df3

   yyyy-mm-dd  year
0  2003-04-18  2003
1  2010-05-12  2010
2  2020-07-27  2020

In [75]:
df3['year_map'] = df3['yyyy-mm-dd'].map(get_year)
df3

   yyyy-mm-dd  year year_map
0  2003-04-18  2003     2003
1  2010-05-12  2010     2010
2  2020-07-27  2020     2020

###  map

In [77]:
student_list = [
    {'name':'kang','sex':'female','major':'Computer Science'},
    {'name':'hana','sex':'male','major':'python'},
    {'name':'hong','sex':'male','major':'java'},
    {'name':'esther','sex':'female','major':'Computer Science'},
    {'name':'kim','sex':'female','major':'java'},
    {'name':'nara','sex':'male','major':'python'},
    {'name':'lee','sex':'female','major':'Computer Science'},
    {'name':'haha','sex':'female','major':'java'},
    {'name':'hohee','sex':'male','major':'python'},
    {'name':'leejo','sex':'female','major':'Computer Science'},
]
df = pd.DataFrame(student_list,columns=['name','sex','major'])
df

     name     sex             major
0    kang  female  Computer Science
1    hana    male            python
2    hong    male              java
3  esther  female  Computer Science
4     kim  female              java
5    nara    male            python
6     lee  female  Computer Science
7    haha  female              java
8   hohee    male            python
9   leejo  female  Computer Science

### merge

In [86]:
list1 = [ {'name':'esther','lang':'python'},
         {'name':'kim','lang':'java'},
         {'name':'hong','lang':'c'},]
list2 = [
     {'name':'esther','lang':'go'},
     {'name':'lee','lang':'R'},
     {'name':'park','lang':'cobol'}
]
df1 = pd.DataFrame(list1)
df2 = pd.DataFrame(list2)

In [83]:
result_df = pd.concat([df1,df2], ignore_index = True)
result_df

     name    lang
0  esther  python
1     kim    java
2    hong       c
3  esther      go
4     lee       R
5    park   cobol

In [93]:
df1.append(df2, ignore_index = True)

     name    lang
0  esther  python
1     kim    java
2    hong       c
3  esther      go
4     lee       R
5    park   cobol

In [95]:
list3 = [
    {"age":23, 'address':'경기도 고양시'},
    {"age":35, 'address':'서울시 강남구'},
    {"age":28, 'address':'서울시 영등포구'},
]

In [100]:
df3 = pd.DataFrame(list3, columns=['age','address'])
df3

   age   address
0   23   경기도 고양시
1   35   서울시 강남구
2   28  서울시 영등포구

- axis : {0/'index', 1/'columns'}, default 0
    The axis to concatenate along.

In [107]:
result_col = pd.concat([df1,df3],axis = 1) # axis default는 0 (row)

In [105]:
result_col

     name    lang  age   address
0  esther  python   23   경기도 고양시
1     kim    java   35   서울시 강남구
2    hong       c   28  서울시 영등포구

### join
- pd.merge : pandas 함수
- join : DataFrame 함수

In [114]:
emp_df = pd.read_csv('pandas_data\employees.csv')
dept_df = pd.read_csv('pandas_data\department.csv')

In [115]:
pd.merge(emp_df,dept_df, on='DEPARTMENT_ID',how = 'left' )

,Unnamed: 0_x,EMPLOYEE_ID,FIRST_NAME,LAST_NAME,EMAIL,PHONE_NUMBER,HIRE_DATE,JOB_ID,SALARY,COMMISSION_PCT,MANAGER_ID_x,DEPARTMENT_ID,Unnamed: 0_y,DEPARTMENT_NAME,MANAGER_ID_y,LOCATION_ID
0,0,100,Steven,King,SKING,515.123.4567,2003-06-17,AD_PRES,24000.0,NaN,NaN,90.0,8.0,Executive,100.0,1700.0
1,1,101,Neena,Kochhar,NKOCHHAR,515.123.4568,2005-09-21,AD_VP,17000.0,NaN,100.0,90.0,8.0,Executive,100.0,1700.0
2,2,102,Lex,De Haan,LDEHAAN,515.123.4569,2001-01-13,AD_VP,17000.0,NaN,100.0,90.0,8.0,Executive,100.0,1700.0
3,3,103,Alexander,Hunold,AHUNOLD,590.423.4567,2006-01-03,IT_PROG,9000.0,NaN,102.0,60.0,5.0,IT,103.0,1400.0
4,4,104,Bruce,Ernst,BERNST,590.423.4568,2007-05-21,IT_PROG,6000.0,NaN,103.0,60.0,5.0,IT,103.0,1400.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
102,102,202,Pat,Fay,PFAY,603.123.6666,2005-08-17,MK_REP,6000.0,NaN,201.0,20.0,1.0,Marketing,201.0,1800.0
103,103,203,Susan,Mavris,SMAVRIS,515.123.7777,2002-06-07,HR_REP,6500.0,NaN,101.0,40.0,3.0,Human Resources,203.0,2400.0
104,104,204,Hermann,Baer,HBAER,515.123.8888,2002-06-07,PR_REP,10000.0,NaN,101.0,70.0,6.0,Public Relations,204.0,2700.0
105,105,205,Shelley,Higgins,SHIGGINS,515.123.8080,2002-06-07,AC_MGR,12008.0,NaN,101.0,110.0,10.0,Accounting,205.0,1700.0
106,106,206,William,Gietz,WGIETZ,515.123.8181,2002-06-07,AC_ACCOUNT,8300.0,NaN,205.0,110.0,10.0,Accounting,205.0,1700.0